Magnus-Wallesverd/IEEE-Nola-Robotics-2026/stm32flash/src/LCD.c
#include "stm32f303.h"

int twos_complement(int val){
	val = ~val + 1;
	return val;
}

static void setup(uint32_t PINS){
    PinWrite(GPIOA, E_PIN);
    PinWrite(GPIOB, (PINS<<OFFSET)&0xFF00);
    for(volatile int i = 0; i < 6; i++);
    ResetPins(GPIOA, E_PIN);
    ResetPins(GPIOB, DATA_PINS);
    for(volatile int i = 0; i < 6; i++);
}

void byte2LCD(char data, uint16_t ctrl_pins){
    PinWrite(GPIOA, ctrl_pins|E_PIN);
    PinWrite(GPIOB, data<<OFFSET);
    for(volatile int i = 0; i < 6; i++);
    ResetPins(GPIOA, E_PIN);
    ResetPins(GPIOA, ctrl_pins);
    ResetPins(GPIOB, data<<OFFSET);
}

static void putchar(char buffer){
    PinWrite(GPIOA, RS_E_PINS);
    PinWrite(GPIOB, buffer<<OFFSET);
    for(volatile int i = 0; i < 6; i++);
    ResetPins(GPIOA, E_PIN);
    ResetPins(GPIOA, RS_PIN);
    ResetPins(GPIOB, buffer<<OFFSET);
    for(volatile int i = 0; i < 6; i++)i;
}

// hex to char array
static void stringify(uint32_t num, char buffer[]){
    char temp = 0;

    for(int i = 0;i<BUFFER_SIZE;i++){
        temp = num % 10;
        num /= 10;
        buffer[BUFFER_SIZE-1-i] = temp + NUM_BASE;
    }

    for(uint8_t i = 0;i<BUFFER_SIZE; i++){
        putchar(buffer[i]);
        buffer[i] = 0;
    }
}

// hex to char array
static void signed_stringify(uint32_t num, char buffer[]){
    char temp = 0;
    if(num>>31){
		byte2LCD('-', RS_PIN);
		num = twos_complement(num);
	} else {
		byte2LCD(' ', RS_PIN);
	}

    for(int i = 0;i<BUFFER_SIZE;i++){
        temp = num % 10;
        num /= 10;
        buffer[BUFFER_SIZE-1-i] = temp + NUM_BASE;
    }

    for(uint8_t i = 0;i<BUFFER_SIZE; i++){
        putchar(buffer[i]);
        buffer[i] = 0;
    }
}


static void print(char buffer[]){
    for(int i = 0; buffer[i] != '\0'; i++){
        PinWrite(GPIOA, RS_E_PINS);
        PinWrite(GPIOB, buffer[i]<<OFFSET);
        for(volatile int i = 0; i < 6; i++);
        ResetPins(GPIOA, E_PIN);
        ResetPins(GPIOA, RS_PIN);
        ResetPins(GPIOB, buffer[i]<<OFFSET);
        for(volatile int i = 0; i < 6; i++);
    }
}

static void lcd_ddram_cmd(uint32_t addr){
    PinWrite(GPIOA, E_PIN);
    PinWrite(GPIOB, addr<<OFFSET);
    for(volatile int i = 0; i < 6; i++);
    ResetPins(GPIOA, E_PIN);
    ResetPins(GPIOB, addr<<OFFSET);
    for(volatile int i = 0; i < 6; i++);
}

void lcd_init(void){
    
    // port setup
    SetPinOutput(GPIOB, DATA_PINS);     //PB15-8 for D7-0
    SetPinOutput(GPIOA, RS_RW_E_PINS);  //PA10-8 for RS,RW,E
                                 
    SetOutputType(GPIOA, RW_PIN, 1);

    SetPinPD(GPIOA, PA8|PA10); 
    SetPinPD(GPIOB, DATA_PINS);
    SetPinPU(GPIOA, RW_PIN);
    
    // initialization
    setup((E_PIN|FUNC_SET));
    setup((E_PIN|DISP_SET));
    setup((E_PIN|CLR_LCD));
    for(volatile int i = 0; i < 1818; i++);
}

void lcd_print(void* args){
    (void)args;
    char entry_1[] = {"TIM2"};
    char entry_2[] = {"TIM3"};
    char entry_3[] = {"TIM4"};
    char entry_4[] = {"TIM8"};
    char buffer_1[BUFFER_SIZE] = {0};
    char buffer_2[BUFFER_SIZE] = {0};
    char buffer_3[BUFFER_SIZE] = {0};
    char buffer_4[BUFFER_SIZE] = {0};
    print(entry_1);
    move_cursor(1, 0);
    print(entry_2);
    move_cursor(2,0);
    print(entry_3);
    move_cursor(3,0);
    print(entry_4);
    move_cursor(4,0);
    uint32_t t0 = 0;
    uint32_t t1 = 0;
    while(1){
        t0 = get_global_tick();
        while((t0-t1) > REFRESH_RATE){
            // signed_stringify((*(get_i2c_buffer()+1)<<8) + *(get_i2c_buffer()),buffer_1);
            move_cursor(0, 7);
            stringify(buf[0], buffer_1);
            move_cursor(1, 7);
            stringify(TIM3->CNT, buffer_2);
            move_cursor(2, 7);
            stringify(TIM4->CNT, buffer_3);
            move_cursor(3, 7);
            stringify(TIM8->CNT, buffer_4);
            t1=t0;
        }
    }
}

void move_cursor(uint32_t x,uint32_t y){
    uint32_t temp;
    if(y>MAX_WIDTH){
        return;
    }BNO055
Data sheet Page 52
BST-BNO055-DS000-12 | Revi si on 1. 2 | November 2014 Bosch Sensortec
© Bosch Sensortec GmbH reserves al l ri ghts even i n the event of i ndustri al property ri ghts. We reserve al l ri ghts of di sposal su ch as copyi ng and
passi ng on to thi rd parti es. BOSCH and the symbol are regi stered trademarks of Robert Bosch GmbH, Germany.
Note: Speci fi cati ons wi thi n thi s document are subj ect to change wi thout noti ce.
Register
Address
Register
Name
Default
Value bit7 bit6 bit5 bit4 bit3 bit2 bit1 bit0
1D EUL_Roll_MSB 0x00 Roll Dat a <15:8>
1C EUL_Roll_LSB 0x00 Roll Dat a <7:0>
1B EUL_Heading_M
SB 0x00 Heading Dat a <15:8>
1A EUL_Heading_L
SB 0x00 
    switch(x){
        case 0:
            temp = (LINE1 | y);
            lcd_ddram_cmd(temp);
            break;
        case 1:
            temp = (LINE2 | y);
            lcd_ddram_cmd(temp);
            break;
        case 2:
            temp = (LINE3 | (y+MAX_WIDTH+1));
            lcd_ddram_cmd(temp);
            break;
        case 3:
            temp = (LINE4 | (y+MAX_WIDTH+1));
            lcd_ddram_cmd(temp);
            break;
    }
}
